app/views/rooms/_review.html.erb

    <%= form_for [review.rooms, review] do |f| %>
      <% Review::POINTS.each do |point| %>
---
SELECT AVG("reviews"."points") FROM "reviews" WHERE "reviews"."room_id" = ?  [["room_id", 12]]