app/controllers/home_controller.rb

	def index
		@rooms = Room.first(3)
---
SELECT  "rooms".* FROM "rooms" ORDER BY "rooms"."id" ASC LIMIT ?  [["LIMIT", 3]]