app/controllers/rooms_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."room_id" = ? AND "reviews"."user_id" = ? LIMIT ?  [["room_id", 4], ["user_id", 11], ["LIMIT", 1]]
---
  def show
    @room = Room.find(params[:id])
    if user_signed_in?
      @user_review = @room.reviews.find_or_initialize_by(user_id: current_user.id)

INSERT INTO "rooms" ("title", "location", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "titulo"], ["location", "Centro"], ["description", "quarto no centro da cidade"], ["created_at", "2017-07-04 18:37:16.407059"], ["updated_at", "2017-07-04 18:37:16.407059"]]
---
  def create
    @room = current_user.rooms.build(room_params)

    respond_to do |format|
      if @room.save

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "rooms" SET "description" = ?, "updated_at" = ? WHERE "rooms"."id" = ?  [["description", "bbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbbb"], ["updated_at", "2017-07-20 01:40:31.417773"], ["id", 10]]
---
  def update
    @room = Room.find(params[:id])
    respond_to do |format|
      #whitelist dos parametros de :room
      if @room.update_attributes(room_params)