app/controllers/rooms_controller.rb

  def index
    @search_query = params[:q]
    rooms = Room.search(@search_query).page(1).per(1)
---
SELECT COUNT(*) FROM "rooms"

  def show
    room_model = Room.where(slug: params[:id]).first
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."slug" = ? ORDER BY "rooms"."id" ASC LIMIT ?  [["slug", "quarto-no-centro"], ["LIMIT", 1]]

  def edit
    @room = Room.where(slug: params[:id]).first
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."slug" = ? ORDER BY "rooms"."id" ASC LIMIT ?  [["slug", "#<RoomPresenter:0x00558fa1f909d0>"], ["LIMIT", 1]]

  def update
    @room = Room.where(slug: params[:id]).first
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."slug" = ? ORDER BY "rooms"."id" ASC LIMIT ?  [["slug", "quarto-em-sao-joao-de-meriti"], ["LIMIT", 1]]