app/controllers/users_controller.rb

INSERT INTO "users" ("full_name", "email", "password_digest", "location", "bio", "created_at", "updated_at", "confirmation_token") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new params
			.require(:user)
			.permit(:full_name, :location, :email, :password, :password_confirmation, :bio)
		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$QMHT67VruavTWBMpMBVJKOr2LBG4B2vZySJRm/LNTLokWS.eElXqG"], ["updated_at", "2017-07-11 16:24:44.263568"], ["id", 4]]
---
	def update
		@user = User.find(params[:id])
		if @user.update_attributes params.require(:user).permit(:full_name,:location, :email, :password, :password_confirmation, :bio)